{"songs": [{"title": "HYFR (Hell Ya F***ing Right) - Album Version (Edited)", "album": null, "year": null, "lyrics": "[Drake]\nGotta do what I gotta do\n\n[Verse 1: Drake]\nAll my exes live in Texas like I'm George Strait\nOr they go to Georgia State where\nTuition is handled by some random nigga that live in Atlanta\nThat she only see when she feels obligated\nAdmitted it to me the first time we dated\nBut she was no angel, and we never waited\n\nI took her for sushi, she wanted to fuck\nSo we took it to go, told them don't even plate it\nAnd we never talk too much after I blew up\nJust only \"hello\" or \"happy belated\"\n\nAnd I think I text her and told her I made it\nAnd that's when she text me and told me she prayed it\nAnd that's when I text her and told her I love it\nAnd right after texting, told her I'm faded\n\nShe asked\nWhat have I learned since getting richer\nI learned working with the negatives could make for better pictures\nI learned Hennessy and enemies is one hell of a mixture\nEven though it's fucked up, girl, I'm still fucking wit' ya\n\nDamn, is it the fall\nTime for me to revisit the past\nIt's women to call\nThere's albums to drop, there's liquor involved\n\nThere's stories to tell, we been through it all\nInterviews are like confessions\nGet the fuck up out my dressing room, confusing me with questions\nLike\n\n[Hook: Lil Wayne]\nDo you love this shit?\nAre you high right now?\nDo you ever get nervous?\nAre you single?\nI heard you fucked your girl, is it true?\nYou getting money? You think them niggas you with is with you?\nAnd I say\n\n(And I say) Hell yeah\nHell yeah, hell yeah\nFucking right\nFucking right, all right\n\n(And we say) Hell yeah\nHell yeah, hell yeah\nFucking right\nFucking right, all right\n\n[Verse 2: Lil Wayne]\nSo much for being optimistic\nThey say love is in the air, so I\nHold my breath until my face turn purple\nKeep a few bad bitches in my circle\n\nMy nuts hang like ain't no curfew\nBitch if you wave, then I will surf you\nI flew jet, she flew commercial\nBut we still met, later that night\n\nAfter my session, she came over\nI was aggressive, and she was sober\nI gave her pills\nShe started confessing and started undressing\n\nAnd ask me to hold her\nAnd so I did, but that was last month\nAnd now she's texting me, asking for closure\nDamn\nShe say this shit gon' catch up to me\nI keep tissue paper\n\nWe eat each other whenever we at the dinner table\nShe say she hate that she love me\nAnd she wish I was average\nShit, sometimes I wish the same\nAnd I wish she wasn't married\n\nPromises, I hope I never break 'em\nMet a female dragon, had a fire conversation but\nInterviews are like confessions\nGet the fuck up out my bedroom confusing me with questions like\n\n[Hook: Lil Wayne]\nDo you love this shit?\nAre you high right now?\nDo you ever get nervous?\nAre you single?\nI heard you fucked your girl, is it true?\nYou getting money? You think them niggas you with is with you?\nAnd I say\n\n(And I say) Hell yeah\nHell yeah, hell yeah\nFucking right\nFucking right, all right\n\n(And we say) Hell yeah\nHell yeah, hell yeah\nFucking right\nFucking right, all right", "image": "https://images.genius.com/22999a3378819809ee4848f7c60a744c.1000x1000x1.jpg"}], "artist": "Drake"}