{"songs": [{"title": "Forever (Born Successful)", "album": "Born Successful", "year": "2009-08-15", "lyrics": "[Chorus: Drake]\nIt may not mean nothing to y'all\nBut understand nothing was done for me\nSo I don't plan on stopping at all\nI want this shit forever, man (ever man, ever man)\nI'm shutting shit down in the mall\nAnd telling every girl she the one for me\nAnd I ain't even planning to call\nI want this shit forever, man (ever man, ever man, ever man)\n\n[Verse 1: Lil Wayne]\nShit nigga, this what I does\nI swear I ain't lyin', like this is my cubs\nThis is my club, and I'm dirtied in the summer bitch\nWeezy F Baby, always lookin' like I've done some shit\nYou ain't know nothin' bitch, better know who you fuckin' with\nTry to fuck me, I kill you and who you comin' with\nNo [?], T I had to go stupid\nI'm on them high heels and I am no bootsy\nHounds Avenue, ridin' with the Phantom roof gone\nThe Maybach two-tone, and my rims are too grown\nThat mean they 24s boy, what are you on?\nI'm richer than a bitch without that grey coupon\nYeah, I'm talkin' out of my head\nI make a blue-eyed bitch just admire my red\nI'm a blood motherfucker, a blood motherfucker\nForever like E T C period motherfucker\n\n[Chorus: Drake]\nIt may not mean nothing to y'all\nBut understand nothing was done for me\nSo I don't plan on stopping at all\nI want this shit forever, man (ever man, ever man)\nI'm shutting shit down in the mall\nAnd telling every girl she the one for me\nAnd I ain't even planning to call\nI want this shit forever, man (ever man, ever man, ever man)\n\n[Verse 2: Drake]\nI'm so unsigned, it would blow one's mind\n'Cause to every single record, I am so unkind\nThere are no holds barred, there is no love lost\nNigga this that crack, and you know drugs cost so P A Y U P\nI don't think you'll ever find another nigga like me, never L I E\nI got everything I tell 'em I got\nThis young nigga showboat like I'm sellin' a yacht\nYou heard me?\nWho else tryna smoke? Yeah nigga, me too\n'Cause take my mind off the pressure is what weed do\nYour girl wetter than the bottom of a Ski-Doo\nAnd take a bitch from any nigga is what we do\nSo bite down ho, or get the right dentist\nI told Wayne I'm goin' in like a life sentence\nAnd understand I send shots at who it's meant for\nNever had a mentor, copy that Tanner?\n\n[Chorus: Drake]\nIt may not mean nothing to y'all\nBut understand nothing was done for me\nSo I don't plan on stopping at all\nI want this shit forever, man (ever man, ever man)", "image": "https://images.genius.com/09c843b49a2466e1a43f2a46ad8bcf1c.500x500x1.jpg"}], "artist": "Drake"}