{"songs": [{"title": "Heat of the Moment", "album": null, "year": "2014-10-25", "lyrics": "[Verse 1]\nAll the school kids are so sick of books and learnin'\nThey don't read anymore, they don't even read anymore\nThey just wanna be like all the rappers that I can't stand\nNiggas we don't need anymore\nAll the niggas we don't need anymore\nAnd all the cops are still hangin' out at the doughnut shops\nTalkin' 'bout how the weather's changin'\nThe ice is meltin' as if the world is endin'\n\n[Hook 1]\nShe asked me\n\"Who are you gonna be when it's all over? When it's all over?\"\nShe asked me\n\"Who are you gonna be when it's all over? When it's all over?\"\nI don't wanna think about that right now\nHeat of the moment\nHeat of the moment, girl, heat of the moment\nI ain't even got a strap, if you think we really need one I'm on it\nThe last man fucked up, I'll take it since he doesn't want it\nCan't think straight in the heat of the moment, heat of the moment\n\n[Interlude]\nWhat are we even doing?\n\n[Verse 2]\nRidin' clean\nWith you on my mind and I'm thinkin' dirty things\nYes Lord, yes Lord, yes Lord\nI've seen some things\nI wish we had met when I was in my teens\nYes Lord, yes Lord, yes Lord\nCause these days I only know conditional love\nI'm not used to settlin' down\nI'm too used to switchin' it up, oh\nAnd she says, \"you don't how good it is to be you cause you're him\"\nAnd I say \"well, goddamn\"\n\n[Hook 2]\nThen ask myself\nWho am I gonna be when it's all over? When it's all over?\nWho am I gonna be when it's all over? When it's all over?\nI don't wanna think about that right now\nHeat of the moment\nHeat of the moment, girl, heat of the moment\nI ain't even got a strap if you think we really need one I'm on it\nThe last man fucked up, I'll take it since he doesn't want it\nCan't think straight in the heat of the moment, heat of the moment\n\n[Outro: Dennis Graham (& Drake)]\nAll of this, it’s alcohol, it’s drugs, weed, it’s everything that you could ever imagine. Man, our sisters, our sisters, and our brothers, our brothers, need to stop this shit. They need to take a step up. Young girls are hot, and they will fuck anybody, anytime, anyway. Because they are so hot and young guys are, they are going for it. This shit has to stop, man. This shit has to stop. These people need uh,uh, uh, uh to educate themselves. Women are too fucking hot\n\n(Yeah, you’re right. You’re right. Alright man, well, shit, I just wanted…)\n\nThey know they’re too hot. They don’t give a fuck. It’s the Heat Of The Moment. It’s the Heat Of The Moment and that’s all it is. It’s The Heat Of The Moment\n\n(I agree.)\n\nThis shit, that’s all it is. It’s the heat of the moment. Be a 100% woman, or try and be a 100% man, and use a fucking condom\n\n(Haaa.)", "image": "https://images.rapgenius.com/c29bfdfd5a903c38a56b5b174115ec1b.1000x1000x1.png"}], "artist": "Drake"}